import socket
import requests
服务器监听地址 = socket.gethostbyname(socket.gethostname())
服务器外网地址 = requests.get('http://myip.ipip.net', timeout=60).text
if 服务器监听地址 == '10.168.1.3':
    服务器外网地址 = '10.168.1.3'
服务器监听端口 = [51230,51231]
游戏IP = '1.1.1.1'
游戏端口 = [8001,6011]
组包包头 = b'\x4d\x5a\x00\x00\x00\x00\x00\x00'
辅助技能 =  "天生神力氣衝斗牛九牛二虎如虎添翼力挽狂瀾\
            揠苗助長火上澆油水漲船高紅花綠葉錦上添花\
            防微杜漸鐵骨錚錚兵來將擋銅牆鐵壁天地渾元\
            十萬火急先聲奪人疾風迅雷風馳電掣兵貴神速\
            鞭長莫及望風撲影化險為夷避實就虛移形換影\
            全力以赴氣貫長虹劍拔弩張勢如破竹力劈玄黃\
            甘之如飴春風化雨潤物無聲醍醐灌頂妙手回春\
            吐故納新防患未然渾然一體雨消雲散水火不侵\
            急如星火星馳電走電光石火飛雲掣電虎嘯風馳\
            虛虛實實故弄玄虛空幻虛實虛空幻影虛無縹緲"
GM账号 = 'hackzy2'
屏蔽辅助 = True
#=======================================================
数据库ip = '124.220.159.66'
sqlport = 8002
数据库用户 = 'root'
数据库密码 = 'password'
注册权限 = 0
goldcoin = 2000000000
silvercoin = 0
注册数量 = 5
data_login = r'(["rec_role":"[GID]","create_time":1667016019,"chars":({"[GID]",}),"safe_status":0,"register_time":0,])'
角色data = r'(["position":(["room":"/tianyongcheng/tianyongcheng.c","dir":5,"x":352,"y":189,]),"me":(["wood":0,"resist_lost":0,"durability":100,"life":17676,"cash":[游戏币],"pot":1760320333,"religion":[新老],"type":1,"first_get_upgrade_time":1680533767,"resist_wood":0,"comp_state":(["2022-08-07-2":1,]),"friend_converted":3,"master":"[师尊]","earth":0,"con":139,"reputation":0,"level_up_time":86175,"seizure_max_cash":"提示：你的現金數量超過了攜帶上限，超出的#Y11,337,524#n文錢#n已被存入錢莊。","version_prompt":(["1.23":1,]),"first_login_time":1680529683,"resist_poison":0,"service":(["天道神符":(["dur":240,]),"八卦神符":(["dur":205,]),]),"voucher":[代金券],"task_finished":(["apprentice_task":1,]),"last_login_time":1680529683,"resisit_wood":0,"dex":[等级],"coin_feed_back":0,"store_converted":1,"stage_tasks":(["tanxun-zhenxiang":1,"liqin_efei":1,"yongqin-yuguai":1,"yaomo-dangdao":1,"chumo-weidao":1,"shilian-zhidao":1,"zhenjia-shenshou":1,]),"polar":[相性],"block_state":0,"lock_exp":0,"polar_wood":0,"create_time":1680529681,"generate_time":1680616143,"last_login_ip":"10.168.1.3","phy_power":735,"resist_metal":0,"anticheater_info":(["interval":86460,"total_steps":37649,"additional_interval":20160,"last_move_time":1680616133,]),"daxing-tumu":(["submit":0,]),"max_cash":59625285,"today_played_time":78543,"balance":11337524,"fire":0,"medicine":([]),"task":([253:(["change_look":63,"start_time":1680613754,"duration":3600,]),754:(["state":"0",]),506:(["finish_time":1680596804,"max_times":13,"receive_times":13,]),729:(["state":"S3","alias":39,"upgrade_type":0,]),192:(["round":1,"end_time":0,"got":0,"upgrade_typetype":0,]),695:(["round":1,"end_time":0,"success":0,"got":0,"upgrade_type":0,]),415:(["level":130,"upgrade_type":0,]),395:(["state":100,"sub_name":"tianjie2","upgrade_type":0,"level":139,"next_task_name":"tianjie3","finished_time":(["tianjie2":"2023-04-04-21:45:32",]),]),644:(["state":"0","upgrade_type":0,]),85:(["state":9999,"owner_gid":"[GID]","rt":1680530993,"finish_task_name":"妖魔道-妖魔當道","upgrade_type":0,]),586:(["state":"0","upgrade_type":0,]),294:(["owner_gid":"[GID]","rt":1680615421,"log":"當前提示：與四大門派的#P西方教主#P、#P太上老君#P、#P通天教主#P、#P准提道人#P交談，並選擇其一做為第二門派。","dbase":(["state":"學習新法術",]),]),21:(["state":0,"times":0,"new_ver":1,"max_times":1,"bonus_time":1680537599,"upgrade_type":0,]),536:([]),]),"fake_suit_icon":0,"age":0,"resist_lock":0,"speed":326,"mana":11881,"init_basic_info":1,"examine":(["cash":134400965,"pot":-1167168684,"voucher":30320000,]),"water":0,"name":"[名字]","accurate":64,"feedback":([]),"protect_bonus":(["ti":1680529683,"hour":0,]),"title_basic":"第一代弟子","random_award":(["1":13,]),"resist_fire":0,"attrib_point":578,"level":139,"resist_frozen":0,"max_life":17676,"extra_mana":4587417,"max_mana":11881,"unique_data":([0:1,1:67592,2:1,]),"appellation":(["family":"[门派]第一代弟子","tianjie":"二劫散仙","仙魔錄":"無量天尊","無顯示":"","upgrade":"飛升",]),"soul_cob_rate":0,"tao":[道行],"account":"[账号]","portrait":6001,"act_stat":(["ti":1680616135,"mons":({0,0,602,}),"ytd":(["5":107,"3":0,"2":14590,"4":2000000000,"1":2109764080,"0":1680537594,]),"td":(["3":548,"2":3,"4":-239679667,"5":398,"1":2126883385,"0":1680615932,]),]),"resist_earth":0,"last_privilege":0,"question":(["answer_times":0,]),"gender":[男女],"max_stamina":238,"last_logout_time":1680616143,"settings":(["convert":1,]),"polar_water":0,"exp_to_next_level":346169214,"polar_earth":0,"gold_coin":[金元宝],"die_stat":([]),"equip_page":0,"cur_pk":0,"restriction":(["login_time":1680529683,]),"character":(["kindness":0,"harmony":0,"desc":"普普通通","carefulness":0,"courage":0,]),"pker":0,"resist_forgotten":0,"polar_already":([]),"metal":0,"total_pk":0,"str":[等级],"cur_ver":4,"medicine_used":([]),"wiz":[等级],"max_balance":174971655,"stamina":220,"def":715,"polar_fire":0,"icon":6001,"max_durability":100,"upgrade":(["bonus":1,"max_polar_extra":12,"max_level":139,"type":[仙魔],"attrib_total":26,"attrib_point":26,"ti_modify":1335590733,"create_time":1680533767,"state":0,"total":9,"cur_ver":3,]),"last_level_up_time":1680615858,"resisit_fire":0,"tao_ex":548,"resist_repress":0,"previous_login_ip":"10.168.1.3","resist_cage":0,"resisit_earth":0,"resist_melt":0,"mag_power":735,"xieling":1,"limit_trade_coin":0,"title_type":"upgrade","total_played_time":86460,"newbie":1,"upgrade_magic":9,"dodge":0,"resist_confusion":0,"top_data":(["speed":50,"def":25,"phy_power":45,"mag_power":45,]),"resisit_water":0,"resist_sleep":0,"gid":"[GID]","first_login_ip":"10.168.1.3","user_converted":1,"max_assign_polar":42,"silver_coin":1999994780,"family":"[门派]","title":"[称谓]","polar_point":108,"achieve":107,"pause_level_up":0,"resist_water":0,"move_type":0,"resisit_metal":0,"have_coin_pwd":0,"upgrade_immortal":9,"total_score":505,"has_upgraded":1,"max_account_lv":139,"polar_metal":0,"extra_life":3856030,"logout_time":1680616143,"attrib_already":([]),"exp":19000000,"limit_per_day":(["92":1,"ti":1680539032,"168":3,]),"scroll":(["time":1680537602,]),"parry":0,"login_times":1,"wrestle":(["score":1000,]),]),"discover_world":(["1":([]),]),"carry":([107:"白玉星冠:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879703,]),255:23,231:([10:32,]),236:([64:28,]),232:107,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",102:"紅雲火霞扇:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882196,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:102,229:([65:5,33:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",101:"紅綾火毒爪:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882328,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:101,229:([65:5,31:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",110:"雷弧閃:([\"type\":8,261:1,255:23,231:([15:170,]),229:([64:28,10:32,15:170,]),228:139,236:([64:28,]),232:112,224:1,233::装备iid:,227:\"130級金系套裝\",234:([]),235:([]),206:\"逍遙贈品\",55:\"黃色\",47:1,26:139,257:([48:4,\"time\":3573100817,]),])",109:"萬霞霓羅裳:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879324,]),255:23,231:([10:32,]),236:([64:28,]),232:109,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",103:"赤眼神龍槍:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882505,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:103,229:([65:5,30:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",108:"天玄真神甲:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879465,]),255:23,231:([10:32,]),236:([64:28,]),232:108,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",111:"三叉盤珠圈:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879113,]),255:23,231:([10:32,]),236:([64:28,]),232:111,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",106:"九彩玲珠冠:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879944,]),255:23,231:([10:32,]),236:([64:28,]),232:106,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",105:"玄黃破堅錘:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721881968,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:105,229:([65:5,34:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",104:"九天玄冥劍:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882051,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:104,229:([65:5,32:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遙贈品\",55:\"金色\",47:1,26:139,])",]),"settings":({({"USER",({2,2,114,}),({2,308,115,}),}),({"",({37,0,1,}),({50,0,1,}),({57,0,0,}),({41,0,1,}),({33,0,1,}),}),}),"skills":(["[回城]":1,"jingying-zhidao":1,"tengyun-jiawu":1,]),])'
角色大飞二 = r'([60415:(["time":1680529684,"progress":0,]),60414:(["time":1680529684,"progress":0,]),60413:(["time":1680529684,"progress":0,]),"update_ti":1680537900,70113:(["failed":1,"time":1680529777,]),"ver":1,70110:(["failed":1,"time":1680529777,]),20406:(["time":1680529943,"finished":1,]),20407:(["para":(["ti":3134,]),"time":1680616013,"progress":23,]),51105:(["time":1680615858,"progress":91,]),51103:(["time":1680529684,"progress":0,]),51102:(["time":1680529684,"progress":0,]),"total":107,51501:(["time":1680615483,"finished":1,]),10505:(["time":1680529684,"progress":0,]),10506:(["time":1680529684,"progress":0,]),40206:(["para":([]),"time":1680529684,"progress":1,]),90336:(["time":1680613081,"finished":1,]),50912:(["time":1680586921,"progress":2,]),50911:(["time":1680529777,"finished":1,]),90331:(["time":1680529777,"finished":1,]),50909:(["time":1680529684,"progress":0,]),50910:(["time":1680529684,"progress":0,]),90316:(["time":1680587548,"progress":9,]),90315:(["time":1680529888,"finished":1,]),40106:(["time":1680529684,"progress":0,]),40105:(["time":1680529684,"progress":0,]),"traces":({}),20110:(["time":1680615858,"progress":0,]),90216:(["time":1680529801,"finished":1,]),90215:(["time":1680529800,"finished":1,]),"lastest":({51501,90336,20406,}),80406:(["time":1680615926,"progress":505,]),80405:(["time":1680615926,"progress":505,]),80404:(["time":1680615926,"progress":505,]),])'
角色大飞三 = r'(["pets":([2:"電精:0:0:([\"attrib\":([\"type\":32768,\"bind_intimacy\":33716,\"property_bind\":([\"attrib\":4,\"time\":-722100438,]),167:2,175:12,174:12,154:5,153:\"GID\",114:12,97:12,93:1,92:([53:-25,52:35,47:70,35:2,17:([118:1,115:1,136:1,]),31:-50,5:110,]),90:-15,89:([36:1002,22:19327,21:5267,16:13367,]),84:([85:1680428832,]),83:-15,72:2,66:([107:30,108:-30,37:30,36:35,2:55,]),73:([107:30,108:30,37:30,36:30,2:30,]),79:0,54:99,53:64,52:97,50:137,51:37982,49:0,48:112491,63:0,57:9,58:0,47:114,46:0,45:27,44:154,43:0,42:616,41:189,40:97,39:\"電精\",38:0,37:37982,36:1002,35:2,34:124,33::宠物iid:,32:0,31:149,29:0,28:611,26:([55:0,]),25:1,24:104,23:3,22:19327,21:5267,19:([42:4,12:1,11:1,9:1,15:1,]),20:0,17:1,16:13367,15:154,14:154,12:154,13:0,11:154,10:0,9:154,8:10000,7:657920040,6:0,5:-13,3:10,2:112491,1:0,]),\"skills\":([124:246,116:246,132:246,]),])",]),"guards":([]),"friends":(["6":([]),"1":([]),"2":([]),"3":([]),"4":([]),"5":([]),]),"children":([]),"practice_pets":([]),])'
角色大飞四 = r'(["upgrade_attrib":(["wood":0,"life":16495,"max_stamina":233,"settings":({({"USER",({2,2,112,}),}),}),"exp_to_next_level":111024092,"die_stat":(["times":2,"time":1680612398,]),"equip_page":0,"earth":0,"con":134,"level_up_time":57278,"polar_already":(["wood":0,"earth":0,"water":0,"total":0,"fire":0,"metal":0,]),"medicine_used":(["sanqingwan":0,"baohua-yuluwan":0,]),"total_pk":0,"metal":0,"str":134,"wiz":134,"stamina":227,"dex":134,"icon":7009,"def":690,"lock_exp":0,"tao_ex":0,"phy_power":710,"mag_power":710,"skills":(["jinhong-guanri":10,"nitian-canren":10,"heding-hongfen":10,]),"medicine":(["life":0,"mana":0,"polar_point":0,"attrib_point":0,]),"fire":0,"dodge":0,"task":([415:(["snap_log":"當前提示：你可以在#P南極仙翁#P處領取到#R130級#n過度裝備。#R請勿錯過該獎勵#n此為新手必須品。","upgrade_type":2,"level":130,]),]),"speed":316,"pets_state":([]),"mana":11135,"water":0,"polar_point":103,"pause_level_up":0,"feedback":(["ti_last_apply":0,"apply_num":0,]),"accurate":65,"attrib_point":532,"level":134,"attrib_already":(["dex":0,"con":0,"total":0,"str":0,"wiz":0,]),"max_life":16495,"exp":1998224631,"max_mana":11135,"parry":0,"tao":0,"portrait":7009,"exp_to_be_added":([]),]),"upgrade_equip":([]),])'
#=================================================================
#套装形象公式 = 假人形象+假人性别+假人等级+假人相性
#坐骑形象公式 = 假人形象+假人性别+假人坐姿+假人相性
假人门派 = ['五龍山云霄洞','終南山玉柱洞','鳳凰山斗闕宮','乾元山金光洞','骷髏山白骨洞']
假人性别 = '6','7'
假人是否坐骑 = '8','7'
假人相性 = ['1','2','3','4','5']
假人装备等级 = '0','1','2','3','4','5','6','070','080','090','100','110','120','130','140','150'
假人武器 = {'1':[1134,1135,1136,1137,1138,1139,1140,1141,1142,1143,1162,1163,1144,1168,1171,1176],
        '2':[1145,1146,1147,1148,1149,1150,1151,1152,1153,1154,1155,1165,1164,1166,1172,1177],
        '3':[1123,1124,1125,1126,1127,1128,1129,1130,1131,1132,1133,1160,1161,1169,1173,1178],
        '4':[1101,1102,1103,1104,1105,1106,1107,1108,1109,1110,1157,1111,1156,1167,1174,1179],
        '5':[1112,1113,1114,1115,1116,1117,1118,1119,1120,1121,1122,1158,1159,1170,1175,1180]}
假人称谓 = ['試道王者','賑災義士','樂善施','賭神','逍遙','學富五車','','','天罡地煞','活躍玩家','百萬富翁','高手','彩民','師門棄徒',
        '天師道人','人品','白幫忙','單挑','通天星君','龍宮狀元','出生入死','教導有方','極惡不赦','漸入佳境','脫胎換骨','威風凜凜',
        '小具法力']
假人坐骑 = {'跨坐':[31001,31016,31023,31002,31020,31022,31005,31017,31021,31003,31018,31024,31025],
        '站姿':[31006,31009,31007,31008,31010],
        '横坐':[31011,31015,31012,31013,31014]}
假人变身 = [6129,6164,6183,6146,6187,6283,20018]
假人坐姿 = [{'跨坐':'003'},{'站姿':'001'},{'横坐':'002'}]
假人飞行法宝 = [1,2,1,2,2,2]
假人帮派图标 = ['216D78178FA6DDB18E5D4F1F61093C45','1FB2EFF8CC881AD8960F6B683C17A389','01EB4FF42F3BEFE33465CF958DEF231A','7B484BE47A89207A9846B3104A8625D6',
          'DC74E5BBCD7DA4147BDDAA71BB80928C','1ACCF44F89846ADAA7F8DA854FECF797','0CFAA31E3740EB25CD008D18A8A6DB3D']
假人名字 = '▁蝶↘戀冰ω銀月囧爧精溫暖眼瞳▌╰灰色城堡聽雨易是溫暖77夜晚星光\
幻想糖果湳宮冰舞1喥↘涳簡↑的陽光給洎巳個微笑媞當初懷淰泠漠,噯\
←艼菔腐蝕僅誋憶…’僸愛?螝禮遙遙無歸期城南尾聲ξ深藍愛夜色朦朧\
紫禁王者檸檬夏天、牸癡鈊絕陌籬ˉ殤花♀冥羽魂殤綄鎂戀舞狂洊在憶\
惡魔夢銘心思念嬞藍色幻想青澀蕪↗夢旅驛站唯夢唯夢﹎.煙花冷\
迷諳少年易是溫暖風中擱淺淚戒依賴╰╮Me詠恒愛陌籬ˉ殤花♀遙遙無歸期\
傳說里的你腐蝕僅誋憶\藍色幻想弈劍ㄨ聽雨閣獨洎守候柏銫味檤禰葑瞳孔中的我\
給洎巳個微笑心疼了暮色伊人微笑瞳孔、戀使√小拇指微笑銫玫瑰兜里有糖硪獨有笨伯\
藦輪約顁驕魂洊、情曲線婉轉夢旅驛站放棄、虛很伈〤冰井、\
綻放硪的青春勾起諷刺傛寒冷滲進的溫暖失去旳溫柔草莓味襯衫溫柔憐惜你╮豬豬下午茶惡魔夢\
夜色朦朧夢如何挽留黑白未來釋懷凹凸曼彽蜩嘩酈恛憶︿夠了紟言灞占邇薀柔╰\
糖ωσ心愛淚化作雨、貳玥眼號洊在憶舊夢璀璨你的小王子冷凌冰沁☆ve戀\
雨誋╰☆╮狼狽→☆νζ落雪無痕→偏執守χμ者'
