
服务器监听地址 = '127.0.0.1'
服务器外网地址 = '127.0.0.1'
服务器监听端口 = [51230,51231]
游戏IP = '124.221.1.5'
游戏端口 = [8001,6011]
组包包头 = b'\x4d\x5a\x00\x00\x00\x00\x00\x00'
辅助技能 =  "天生神力氣衝斗牛九牛二虎如虎添翼力挽狂瀾\
            揠苗助長火上澆油水漲船高紅花綠葉錦上添花\
            防微杜漸鐵骨錚錚兵來將擋銅牆鐵壁天地渾元\
            十萬火急先聲奪人疾風迅雷風馳電掣兵貴神速\
            鞭長莫及望風撲影化險為夷避實就虛移形換影\
            全力以赴氣貫長虹劍拔弩張勢如破竹力劈玄黃\
            甘之如飴春風化雨潤物無聲醍醐灌頂妙手回春\
            吐故納新防患未然渾然一體雨消雲散水火不侵\
            急如星火星馳電走電光石火飛雲掣電虎嘯風馳\
            虛虛實實故弄玄虛空幻虛實虛空幻影虛無縹緲"
GM账号 = 'hackzy2'