import socket
import requests
服务器监听地址 = socket.gethostbyname(socket.gethostname())
服务器外网地址 = requests.get('http://myip.ipip.net', timeout=60).text
if 服务器监听地址 == '10.168.1.3':
    服务器外网地址 = '10.168.1.3'
服务器监听端口 = [51232,51233,51234]
游戏IP = '10.168.1.10'
游戏端口 = [8101,8160,8161]
组包包头 = b'\x4d\x5a\x00\x00\x00\x00\x00\x00'
辅助技能 =  "天生神力气冲斗牛九牛二虎如虎添翼力挽狂澜\
            揠苗助长火上浇油水涨船高红花绿叶锦上添花\
            防微杜渐铁骨铮铮兵来将挡铜墙铁壁天地浑元\
            十万火急先声夺人疾风迅雷风驰电掣兵贵神速\
            鞭长莫及望风扑影化险为夷避实就虚移形换影\
            全力以赴气贯长虹剑拔弩张势如破竹力劈玄黄\
            甘之如饴春风化雨润物无声醍醐灌顶妙手回春\
            吐故纳新防患未然浑然一体雨消云散水火不侵\
            急如星火星驰电走电光石火飞云掣电虎啸风驰\
            虚虚实实故弄玄虚空幻虚实虚空幻影虚无缥缈"
GM账号 = '1'
屏蔽辅助 = True
#=======================================================
普通注册 = True
大飞注册 = False
数据库ip = '10.168.1.10'
数据库用户 = 'root'
数据库密码 = 'Chen102101!'
adb库 = 'dl_adb_all'
ddb库 = 'dl_ddb_1'
注册监听端口 = 2878
数据库端口 = 3306
注册权限 = 0
goldcoin = 2000000000
silvercoin = 0
注册数量 = 5
data_login = r'(["rec_role":"[GID]","create_time":1667016019,"chars":({"[GID]",}),"safe_status":0,"register_time":0,])'
角色data = r'(["position":(["room":"/tianyongcheng/tianyongcheng.c","dir":5,"x":352,"y":189,]),"me":(["wood":0,"resist_lost":0,"durability":100,"life":17676,"cash":[游戏币],"pot":1760320333,"religion":[新老],"type":1,"first_get_upgrade_time":1680533767,"resist_wood":0,"comp_state":(["2022-08-07-2":1,]),"friend_converted":3,"master":"[师尊]","earth":0,"con":139,"reputation":0,"level_up_time":86175,"seizure_max_cash":"提示：你的现金数量超过了携带上限，超出的#Y11,337,524#n文钱#n已被存入钱庄。","version_prompt":(["1.23":1,]),"first_login_time":1680529683,"resist_poison":0,"service":(["天道神符":(["dur":240,]),"八卦神符":(["dur":205,]),]),"voucher":[代金券],"task_finished":(["apprentice_task":1,]),"last_login_time":1680529683,"resisit_wood":0,"dex":[等级],"coin_feed_back":0,"store_converted":1,"stage_tasks":(["tanxun-zhenxiang":1,"liqin_efei":1,"yongqin-yuguai":1,"yaomo-dangdao":1,"chumo-weidao":1,"shilian-zhidao":1,"zhenjia-shenshou":1,]),"polar":[相性],"block_state":0,"lock_exp":0,"polar_wood":0,"create_time":1680529681,"generate_time":1680616143,"last_login_ip":"10.168.1.3","phy_power":735,"resist_metal":0,"anticheater_info":(["interval":86460,"total_steps":37649,"additional_interval":20160,"last_move_time":1680616133,]),"daxing-tumu":(["submit":0,]),"max_cash":59625285,"today_played_time":78543,"balance":11337524,"fire":0,"medicine":([]),"task":([253:(["change_look":63,"start_time":1680613754,"duration":3600,]),754:(["state":"0",]),506:(["finish_time":1680596804,"max_times":13,"receive_times":13,]),729:(["state":"S3","alias":39,"upgrade_type":0,]),192:(["round":1,"end_time":0,"got":0,"upgrade_typetype":0,]),695:(["round":1,"end_time":0,"success":0,"got":0,"upgrade_type":0,]),415:(["level":130,"upgrade_type":0,]),395:(["state":100,"sub_name":"tianjie2","upgrade_type":0,"level":139,"next_task_name":"tianjie3","finished_time":(["tianjie2":"2023-04-04-21:45:32",]),]),644:(["state":"0","upgrade_type":0,]),85:(["state":9999,"owner_gid":"[GID]","rt":1680530993,"finish_task_name":"妖魔道-妖魔当道","upgrade_type":0,]),586:(["state":"0","upgrade_type":0,]),294:(["owner_gid":"[GID]","rt":1680615421,"log":"当前提示：与四大门派的#P西方教主#P、#P太上老君#P、#P通天教主#P、#P准提道人#P交谈，并选择其一做为第二门派。","dbase":(["state":"学习新法术",]),]),21:(["state":0,"times":0,"new_ver":1,"max_times":1,"bonus_time":1680537599,"upgrade_type":0,]),536:([]),]),"fake_suit_icon":0,"age":0,"resist_lock":0,"speed":326,"mana":11881,"init_basic_info":1,"examine":(["cash":134400965,"pot":-1167168684,"voucher":30320000,]),"water":0,"name":"[名字]","accurate":64,"feedback":([]),"protect_bonus":(["ti":1680529683,"hour":0,]),"title_basic":"第一代弟子","random_award":(["1":13,]),"resist_fire":0,"attrib_point":578,"level":139,"resist_frozen":0,"max_life":17676,"extra_mana":4587417,"max_mana":11881,"unique_data":([0:1,1:67592,2:1,]),"appellation":(["family":"[门派]第一代弟子","tianjie":"二劫散仙","仙魔录":"无量天尊","无显示":"","upgrade":"飞升",]),"soul_cob_rate":0,"tao":[道行],"account":"[账号]","portrait":6001,"act_stat":(["ti":1680616135,"mons":({0,0,602,}),"ytd":(["5":107,"3":0,"2":14590,"4":2000000000,"1":2109764080,"0":1680537594,]),"td":(["3":548,"2":3,"4":-239679667,"5":398,"1":2126883385,"0":1680615932,]),]),"resist_earth":0,"last_privilege":0,"question":(["answer_times":0,]),"gender":[男女],"max_stamina":238,"last_logout_time":1680616143,"settings":(["convert":1,]),"polar_water":0,"exp_to_next_level":346169214,"polar_earth":0,"gold_coin":[金元宝],"die_stat":([]),"equip_page":0,"cur_pk":0,"restriction":(["login_time":1680529683,]),"character":(["kindness":0,"harmony":0,"desc":"普普通通","carefulness":0,"courage":0,]),"pker":0,"resist_forgotten":0,"polar_already":([]),"metal":0,"total_pk":0,"str":[等级],"cur_ver":4,"medicine_used":([]),"wiz":[等级],"max_balance":174971655,"stamina":220,"def":715,"polar_fire":0,"icon":6001,"max_durability":100,"upgrade":(["bonus":1,"max_polar_extra":12,"max_level":139,"type":[仙魔],"attrib_total":26,"attrib_point":26,"ti_modify":1335590733,"create_time":1680533767,"state":0,"total":9,"cur_ver":3,]),"last_level_up_time":1680615858,"resisit_fire":0,"tao_ex":548,"resist_repress":0,"previous_login_ip":"10.168.1.3","resist_cage":0,"resisit_earth":0,"resist_melt":0,"mag_power":735,"xieling":1,"limit_trade_coin":0,"title_type":"upgrade","total_played_time":86460,"newbie":1,"upgrade_magic":9,"dodge":0,"resist_confusion":0,"top_data":(["speed":50,"def":25,"phy_power":45,"mag_power":45,]),"resisit_water":0,"resist_sleep":0,"gid":"[GID]","first_login_ip":"10.168.1.3","user_converted":1,"max_assign_polar":42,"silver_coin":1999994780,"family":"[门派]","title":"[称谓]","polar_point":108,"achieve":107,"pause_level_up":0,"resist_water":0,"move_type":0,"resisit_metal":0,"have_coin_pwd":0,"upgrade_immortal":9,"total_score":505,"has_upgraded":1,"max_account_lv":139,"polar_metal":0,"extra_life":3856030,"logout_time":1680616143,"attrib_already":([]),"exp":19000000,"limit_per_day":(["92":1,"ti":1680539032,"168":3,]),"scroll":(["time":1680537602,]),"parry":0,"login_times":1,"wrestle":(["score":1000,]),]),"discover_world":(["1":([]),]),"carry":([107:"白玉星冠:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879703,]),255:23,231:([10:32,]),236:([64:28,]),232:107,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",102:"红云火霞扇:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882196,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:102,229:([65:5,33:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",101:"红绫火毒爪:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882328,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:101,229:([65:5,31:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",110:"雷弧闪:([\"type\":8,261:1,255:23,231:([15:170,]),229:([64:28,10:32,15:170,]),228:139,236:([64:28,]),232:112,224:1,233::装备iid:,227:\"130级金系套装\",234:([]),235:([]),206:\"逍遥赠品\",55:\"黄色\",47:1,26:139,257:([48:4,\"time\":3573100817,]),])",109:"万霞霓罗裳:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879324,]),255:23,231:([10:32,]),236:([64:28,]),232:109,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",103:"赤眼神龙枪:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882505,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:103,229:([65:5,30:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",108:"天玄真神甲:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879465,]),255:23,231:([10:32,]),236:([64:28,]),232:108,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",111:"三叉盘珠圈:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879113,]),255:23,231:([10:32,]),236:([64:28,]),232:111,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",106:"九彩玲珠冠:([\"type\":8,261:1,256:85,257:([48:4,\"time\":-721879944,]),255:23,231:([10:32,]),236:([64:28,]),232:106,229:([64:28,10:32,14:32,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",105:"玄黄破坚锤:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721881968,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:105,229:([65:5,34:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",104:"九天玄冥剑:([\"type\":8,261:1,256:83,257:([48:4,\"time\":-721882051,]),255:23,231:([65:5,]),236:([11:3800,3:3800,]),232:104,229:([65:5,32:5,11:3800,3:3800,]),233::装备iid:,234:([]),206:\"逍遥赠品\",55:\"金色\",47:1,26:139,])",]),"settings":({({"USER",({2,2,114,}),({2,308,115,}),}),({"",({37,0,1,}),({50,0,1,}),({57,0,0,}),({41,0,1,}),({33,0,1,}),}),}),"skills":(["[回城]":1,"jingying-zhidao":1,"tengyun-jiawu":1,]),])'
角色大飞二 = r'([60415:(["time":1680529684,"progress":0,]),60414:(["time":1680529684,"progress":0,]),60413:(["time":1680529684,"progress":0,]),"update_ti":1680537900,70113:(["failed":1,"time":1680529777,]),"ver":1,70110:(["failed":1,"time":1680529777,]),20406:(["time":1680529943,"finished":1,]),20407:(["para":(["ti":3134,]),"time":1680616013,"progress":23,]),51105:(["time":1680615858,"progress":91,]),51103:(["time":1680529684,"progress":0,]),51102:(["time":1680529684,"progress":0,]),"total":107,51501:(["time":1680615483,"finished":1,]),10505:(["time":1680529684,"progress":0,]),10506:(["time":1680529684,"progress":0,]),40206:(["para":([]),"time":1680529684,"progress":1,]),90336:(["time":1680613081,"finished":1,]),50912:(["time":1680586921,"progress":2,]),50911:(["time":1680529777,"finished":1,]),90331:(["time":1680529777,"finished":1,]),50909:(["time":1680529684,"progress":0,]),50910:(["time":1680529684,"progress":0,]),90316:(["time":1680587548,"progress":9,]),90315:(["time":1680529888,"finished":1,]),40106:(["time":1680529684,"progress":0,]),40105:(["time":1680529684,"progress":0,]),"traces":({}),20110:(["time":1680615858,"progress":0,]),90216:(["time":1680529801,"finished":1,]),90215:(["time":1680529800,"finished":1,]),"lastest":({51501,90336,20406,}),80406:(["time":1680615926,"progress":505,]),80405:(["time":1680615926,"progress":505,]),80404:(["time":1680615926,"progress":505,]),])'
角色大飞三 = r'(["pets":([2:"电精:0:0:([\"attrib\":([\"type\":32768,\"bind_intimacy\":33716,\"property_bind\":([\"attrib\":4,\"time\":-722100438,]),167:2,175:12,174:12,154:5,153:\"GID\",114:12,97:12,93:1,92:([53:-25,52:35,47:70,35:2,17:([118:1,115:1,136:1,]),31:-50,5:110,]),90:-15,89:([36:1002,22:19327,21:5267,16:13367,]),84:([85:1680428832,]),83:-15,72:2,66:([107:30,108:-30,37:30,36:35,2:55,]),73:([107:30,108:30,37:30,36:30,2:30,]),79:0,54:99,53:64,52:97,50:137,51:37982,49:0,48:112491,63:0,57:9,58:0,47:114,46:0,45:27,44:154,43:0,42:616,41:189,40:97,39:\"电精\",38:0,37:37982,36:1002,35:2,34:124,33::宠物iid:,32:0,31:149,29:0,28:611,26:([55:0,]),25:1,24:104,23:3,22:19327,21:5267,19:([42:4,12:1,11:1,9:1,15:1,]),20:0,17:1,16:13367,15:154,14:154,12:154,13:0,11:154,10:0,9:154,8:10000,7:657920040,6:0,5:-13,3:10,2:112491,1:0,]),\"skills\":([124:246,116:246,132:246,]),])",]),"guards":([]),"friends":(["6":([]),"1":([]),"2":([]),"3":([]),"4":([]),"5":([]),]),"children":([]),"practice_pets":([]),])'
角色大飞四 = r'(["upgrade_attrib":(["wood":0,"life":16495,"max_stamina":233,"settings":({({"USER",({2,2,112,}),}),}),"exp_to_next_level":111024092,"die_stat":(["times":2,"time":1680612398,]),"equip_page":0,"earth":0,"con":134,"level_up_time":57278,"polar_already":(["wood":0,"earth":0,"water":0,"total":0,"fire":0,"metal":0,]),"medicine_used":(["sanqingwan":0,"baohua-yuluwan":0,]),"total_pk":0,"metal":0,"str":134,"wiz":134,"stamina":227,"dex":134,"icon":7009,"def":690,"lock_exp":0,"tao_ex":0,"phy_power":710,"mag_power":710,"skills":(["jinhong-guanri":10,"nitian-canren":10,"heding-hongfen":10,]),"medicine":(["life":0,"mana":0,"polar_point":0,"attrib_point":0,]),"fire":0,"dodge":0,"task":([415:(["snap_log":"当前提示：你可以在#P南极仙翁#P处领取到#R130级#n过度装备。#R请勿错过该奖励#n此为新手必须品。","upgrade_type":2,"level":130,]),]),"speed":316,"pets_state":([]),"mana":11135,"water":0,"polar_point":103,"pause_level_up":0,"feedback":(["ti_last_apply":0,"apply_num":0,]),"accurate":65,"attrib_point":532,"level":134,"attrib_already":(["dex":0,"con":0,"total":0,"str":0,"wiz":0,]),"max_life":16495,"exp":1998224631,"max_mana":11135,"parry":0,"tao":0,"portrait":7009,"exp_to_be_added":([]),]),"upgrade_equip":([]),])'
#=================================================================
#套装形象公式 = 假人形象+假人性别+假人等级+假人相性
#坐骑形象公式 = 假人形象+假人性别+假人坐姿+假人相性
假人门派 = ['五龙山云霄洞','终南山玉柱洞','凤凰山斗阙宫','乾元山金光洞','骷髅山白骨洞']
假人性别 = '6','7'
假人是否坐骑 = '8','7'
假人相性 = ['1','2','3','4','5']
假人装备等级 = '0','1','2','3','4','5','6','070','080','090','100','110','120','130','140','150'
假人武器 = {'1':[1134,1135,1136,1137,1138,1139,1140,1141,1142,1143,1162,1163,1144,1168,1171,1176],
        '2':[1145,1146,1147,1148,1149,1150,1151,1152,1153,1154,1155,1165,1164,1166,1172,1177],
        '3':[1123,1124,1125,1126,1127,1128,1129,1130,1131,1132,1133,1160,1161,1169,1173,1178],
        '4':[1101,1102,1103,1104,1105,1106,1107,1108,1109,1110,1157,1111,1156,1167,1174,1179],
        '5':[1112,1113,1114,1115,1116,1117,1118,1119,1120,1121,1122,1158,1159,1170,1175,1180]}
假人称谓 = ['试道王者','赈灾义士','乐善施','赌神','逍遥','学富五车','','','天罡地煞','活跃玩家','百万富翁','高手','彩民','师门弃徒',
        '天师道人','人品','白帮忙','单挑','通天星君','龙宫状元','出生入死','教导有方','极恶不赦','渐入佳境','脱胎换骨','威风凛凛',
        '小具法力']
假人坐骑 = {'跨坐':[31001,31016,31023,31002,31020,31022,31005,31017,31021,31003,31018,31024,31025],
        '站姿':[31006,31009,31007,31008,31010],
        '横坐':[31011,31015,31012,31013,31014]}
假人变身 = [6129,6164,6183,6146,6187,6283,20018]
假人坐姿 = [{'跨坐':'003'},{'站姿':'001'},{'横坐':'002'}]
假人飞行法宝 = [1,2,1,2,2,2]
假人帮派图标 = ['216D78178FA6DDB18E5D4F1F61093C45','1FB2EFF8CC881AD8960F6B683C17A389','01EB4FF42F3BEFE33465CF958DEF231A','7B484BE47A89207A9846B3104A8625D6',
          'DC74E5BBCD7DA4147BDDAA71BB80928C','1ACCF44F89846ADAA7F8DA854FECF797','0CFAA31E3740EB25CD008D18A8A6DB3D']
假人名字 = '▁蝶↘恋冰ω银月囧爧精温暖眼瞳▌╰灰色城堡听雨易是温暖77夜晚星光\
幻想糖果湳宫冰舞1喥↘涳简↑的阳光给洎巳个微笑媞当初怀淰泠漠,嗳\
←艼菔腐蚀仅誋忆…’僸爱?螝礼遥遥无归期城南尾声ξ深蓝爱夜色朦胧\
紫禁王者柠檬夏天、牸痴鈊绝陌篱ˉ殇花♀冥羽魂殇綄镁恋舞狂洊在忆\
恶魔梦铭心思念嬞蓝色幻想青涩芜↗梦旅驿站唯梦唯梦﹎.烟花冷\
迷谙少年易是温暖风中搁浅泪戒依赖╰╮Me咏恒爱陌篱ˉ殇花♀遥遥无归期\
传说里的你腐蚀仅誋忆\蓝色幻想弈剑ㄨ听雨阁独洎守候柏铯味檤祢葑瞳孔中的我\
给洎巳个微笑心疼了暮色伊人微笑瞳孔、恋使√小拇指微笑铯玫瑰兜里有糖硪独有笨伯\
藦轮约顁骄魂洊、情曲线婉转梦旅驿站放弃、虚很伈〤冰井、\
绽放硪的青春勾起讽刺傛寒冷渗进的温暖失去旳温柔草莓味衬衫温柔怜惜你╮猪猪下午茶恶魔梦\
夜色朦胧梦如何挽留黑白未来释怀凹凸曼彽蜩哗郦恛忆︿够了紟言灞占迩薀柔╰\
糖ωσ心爱泪化作雨、贰玥眼号洊在忆旧梦璀璨你的小王子冷凌冰沁☆ve恋\
雨誋╰☆╮狼狈→☆νζ落雪无痕→偏执守χμ者'
#=====================================================================================================================================
心法 = """气血增加|057A
速度增加|057C
攻击增加|0579
防御增加|057B
伤害反馈|05A2
气血转换|05A3
法力转换|05A9
生命汲取|0585
汲取法力|05A7
障碍萃法|05AC
天机萃法|05AA
天技回生|05A4
辅助回生|05A5
障碍回生|05A6
阻抗镇魂|05C1
阻抗化功|05C2
阻抗神圣|05BB
阻抗冰冻|05BE
阻抗水牢|05C3
阻抗中毒|05BD
阻抗迷心|05C5
阻抗漫天|05B9
阻抗锁灵|05C4
阻抗昏睡|05BF
阻抗舍命|05B8
阻抗游说|05B7
阻抗翻转|05BA
阻抗遗忘|05BC
高阶防御|05A1
高阶速度|05C6
高阶游说|05B2
高阶神圣|05B6
高阶狂暴|058A
高阶漫天|05B4
高阶舍命|05B3
高阶必杀|0587
高阶连击|0588
高阶反击|058B
高阶翻转|05B5
多层法术|058C
防不胜防|0589
撕裂伤口|0586
乘胜追击|0584
解意之击|0595
破龙之击|0582
强力舍命|05AE
强力翻转|05B0
强力神圣|05B1
强力游说|05AD
强力漫天|05AF
忽视抗金|0590
忽视抗木|0591
忽视抗水|0592
忽视抗火|0593
忽视抗土|0594
物理吸收|059A
法术吸收|059B
一阶反击|058D
二阶反击|058E
四阶反击|058F
防御加强|059E
抗性加强|059F
抵消混元|0598
抵消法必|0597
物理免死|059C
法术免死|059D
千军破敌|0583
法术汲取|0596
辅助萃法|05AB
抵消番天|0599
阻抗混乱|05C0
能量攻击|05A8
闪避加强|05A0""".split('\n')